'''
描述
字符串反码的定义为：字符串所包含字符的反码组成的字符串。‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬

字符反码的定义为：‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬

(1) 对于小写英文字符，它的反码也是一个小写英文字符，且该字符与'a'的距离等于其反码与'z'的距离；‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬

(2) 对于大写英文字符，它的反码也是一个大写英文字符，且该字符与'A'的距离等于其反码与'Z'的距离；‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬

两个字符距离指其对应unicode编码之差。‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬
'''
'''
思路：
程序分为以下部分：
1.判断是否为字母，如果是进行处理，否则不处理
2.如果是字母区分大小写
3.对字母进行反码表示
'''


def Translate(ch):
    if ch >= 'a' and ch <= 'z':
        return chr(ord('z') + ord('a') - ord(ch))
    elif ch >= 'A' and ch <= 'Z':
        return chr(ord('A') + ord('Z') - ord(ch))
    else:
        return ch


lst = str(input())
out_lst = ""
for i in lst:
    out_lst += Translate(i)
print(out_lst)